# POSTTEST 4

Nama : Muhammad Akbar Fahrezi

NIM  : 2109106117

Informatika C1-21

## IMPORT LIBRARY

In [5]:
import numpy as np
import pandas as pd
from sklearn.preprocessing import MinMaxScaler, StandardScaler, OneHotEncoder
from sklearn.model_selection import train_test_split
from sklearn.impute import SimpleImputer

## INFO DATA

In [6]:
import pandas as pd
df = pd.read_csv('Bank Customer Churn Prediction.csv')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   customer_id       10000 non-null  int64
 1   credit_score      10000 non-null  int64
 2   country           10000 non-null  object
 3   gender            10000 non-null  object
 4   age               10000 non-null  int64
 5   tenure            10000 non-null  int64
 6   balance           10000 non-null  float64
 7   products_number   10000 non-null  int64
 8   credit_card       10000 non-null  int64
 9   active_member     10000 non-null  int64
 10  estimated_salary  10000 non-null  float64
 11  churn             10000 non-null  int64
dtypes: float64(2), int64(8), object(2)
memory usage: 937.6+ KB

In [8]:
df.shape

(10000, 12)

## Data split 70:30
- Bagi dataset menjadi training set dan testing set dengan proporsi 70:30

In [10]:
X = df.iloc[:, : -1]
y = df.iloc[:, -1]

X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.3)

print("Dimensi X_train", X_train.shape)
print("Dimensi X_test", X_test.shape)
print("Dimensi y_train", y_train.shape)
print("Dimensi y_test", y_test.shape)

Dimensi X_train (7000, 11)
Dimensi X_test (3000, 11)
Dimensi y_train (7000,)
Dimensi y_test (3000,)

## NORMALISASI DATA
- Lakukan normalisasi data pada salah satu attribute menggunakan Min Max scaler (buatlah copy dataset terlebih dahulu)

In [16]:
min_max = MinMaxScaler()

# Copy Data
copy1 = df
dataCopy_normalization = copy1[["estimated_salary"]]

normalization = min_max.fit_transform(dataCopy_normalization[["estimated_salary"]])

df_normalization = pd.DataFrame(normalization)
df_normalization.columns =["estimated_salary_Normalization"]

dataCopy_normalization = dataCopy_normalization.join(df_normalization["estimated_salary_Normalization"]).reset_index()
dataCopy_normalization = dataCopy_normalization.drop("index", axis=1)

print()
print("Data Sebelum dan Sesudah dilakukan normalisasi : \n")
dataCopy_normalization.head(10)

Data Sebelum dan Sesudah dilakukan normalisasi :

   estimated_salary  estimated_salary_Normalization
0         101348.88                        0.506735
1         112542.58                        0.562709
2         113931.57                        0.569654
3          93826.63                        0.469120
4          79084.10                        0.395400
5         149756.71                        0.748797
6          10062.80                        0.050261
7         119346.88                        0.596733
8          74940.50                        0.374680
9          71725.73                        0.358605

## DATA CLEANING 
### Nilai null
Lakukan Data cleaning pada data dengan nilai null (jika tidak ada nilai null pada dataset, maka buatlah menjadi ada). Ganti nilai null sesuai ketentuan. (bilangan bulat : median/modus, bilangan desimal : mean, tulisan : modus). Nilai plus jika strategy yang digunakan menggunakan 3 nilai

In [23]:
df.isna().sum()

customer_id         0
credit_score        0
country             0
gender              0
age                 0
tenure              0
balance             0
products_number     0
credit_card         0
active_member       0
estimated_salary    0
churn               0
dtype: int64

## Karna Tidak ada Nilai null maka

In [37]:
pd.options.mode.chained_assignment = None

df.age[[1,10,20,30,40,50,60,70,80,90,100]]=None;
df.products_number[[1,10,20,30,40,50,60,70,80,90,100]]=None;
df.estimated_salary[[1,10,20,30,40,50,60,70,80,90,100]]=None;

df[df.isnull().any(axis=1)]

,customer_id,credit_score,country,gender,age,tenure,balance,products_number,credit_card,active_member,estimated_salary,churn
1,15647311,608,Spain,Female,NaN,1,83807.86,NaN,0,NaN,NaN,0
10,15767821,528,France,Male,NaN,6,102016.72,NaN,0,NaN,NaN,0
20,15577657,732,France,Male,NaN,8,0.00,NaN,1,NaN,NaN,0
30,15589475,591,Spain,Female,NaN,3,0.00,NaN,1,NaN,NaN,1
40,15619360,472,Spain,Male,NaN,4,0.00,NaN,1,NaN,NaN,0
50,15616550,698,Germany,Male,NaN,10,116363.37,NaN,1,NaN,NaN,0
60,15651280,742,Germany,Male,NaN,5,136857.00,NaN,0,NaN,NaN,0
70,15703793,738,Germany,Male,NaN,2,133745.44,NaN,1,NaN,NaN,1
80,15706021,665,France,Female,NaN,1,96645.54,NaN,0,NaN,NaN,0
90,15757535,647,Spain,Female,NaN,5,0.00,NaN,1,NaN,NaN,1
100,15808582,665,France,Female,NaN,6,0.00,NaN,1,NaN,NaN,0

### Data Bilangan Bulat dengan Strategi Median

In [30]:
strategi1 = SimpleImputer(strategy="median")

df["age"] = strategi1.fit_transform(df[["age"]])

df.isna().sum()

customer_id          0
credit_score         0
country              0
gender               0
age                  0
tenure               0
balance              0
products_number      0
credit_card          0
active_member       11
estimated_salary     0
churn                0
dtype: int64

In [31]:
print(df.age[[1,10,20,30,40,50,60,70,80,90,100]])

1      37.0
10     37.0
20     37.0
30     37.0
40     37.0
50     37.0
60     37.0
70     37.0
80     37.0
90     37.0
100    37.0
Name: age, dtype: float64

### Data Bilangan Desimal dengan Strategi Mean

In [38]:
strategi2 = SimpleImputer(strategy="mean")

df["estimated_salary"] = strategi2.fit_transform(df[["estimated_salary"]])

df.isna().sum()

customer_id          0
credit_score         0
country              0
gender               0
age                 11
tenure               0
balance              0
products_number     11
credit_card          0
active_member       11
estimated_salary     0
churn                0
dtype: int64

In [39]:
print(df.estimated_salary[[1,10,20,30,40,50,60,70,80,90,100]])

1      100061.042731
10     100061.042731
20     100061.042731
30     100061.042731
40     100061.042731
50     100061.042731
60     100061.042731
70     100061.042731
80     100061.042731
90     100061.042731
100    100061.042731
Name: estimated_salary, dtype: float64

### Data Tulisan dengan Strategi Modus

In [40]:
strategi3 = SimpleImputer(missing_values=None, strategy="most_frequent")

df["country"] = strategi3.fit_transform(df[["country"]])

df.isna().sum()

customer_id          0
credit_score         0
country              0
gender               0
age                 11
tenure               0
balance              0
products_number     11
credit_card          0
active_member       11
estimated_salary     0
churn                0
dtype: int64

In [41]:
print(df.country[[1,10,20,30,40,50,60,70,80,90,100]])

1        Spain
10      France
20      France
30       Spain
40       Spain
50     Germany
60     Germany
70     Germany
80      France
90       Spain
100     France
Name: country, dtype: object

### Nilai Duplikat 
Lakukan Data cleaning pada data dengan nilai duplikat. (Jika tidak ada nilai duplikat pada dataset, maka buatlah menjadi ada).

In [24]:
df[df.duplicated()]

print("Jumlah Data Duplikat : ")
df.duplicated().sum()

Jumlah Data Duplikat :

0

### Karena tidak ada data duplikat maka

In [21]:
make_duplicated = pd.concat([df]*2, ignore_index=True)
make_duplicated.duplicated()

print("Jumlah data duplicated sekarang :")
make_duplicated.duplicated().sum()

Jumlah data duplicated sekarang :

10000

In [22]:
make_duplicated.drop_duplicates(inplace=True)

hasil = make_duplicated.reset_index(drop=True)
print("Jumlah data duplicated setelah di drop :")
hasil.duplicated().sum()

Jumlah data duplicated setelah di drop :

0

## Ganti tipe data salah satu attribute angka

In [46]:
print("Tipe data tenure sebelum diubah :")
df["tenure"].dtypes

Tipe data tenure sebelum diubah :

dtype('int64')

In [47]:
ubah_dtype = df["tenure"].astype("float")
print("Tipe data tenure setelah diubah :")
ubah_dtype.dtypes

Tipe data tenure setelah diubah :

dtype('float64')

## Lakukan one hot encoding pada dataset yang kalian miliki

In [50]:
one_hot = OneHotEncoder(sparse_output=False)

df_onehot = one_hot.fit_transform(df[["country"]])
df_onehot = pd.DataFrame(df_onehot)
df_oh = df[['country']].join(df_onehot)


df_oh.head(10)

   country    0    1    2
0   France  1.0  0.0  0.0
1    Spain  0.0  0.0  1.0
2   France  1.0  0.0  0.0
3   France  1.0  0.0  0.0
4    Spain  0.0  0.0  1.0
5    Spain  0.0  0.0  1.0
6   France  1.0  0.0  0.0
7  Germany  0.0  1.0  0.0
8   France  1.0  0.0  0.0
9   France  1.0  0.0  0.0